# from letters import uyir, aytham, uyir_kuril, uyil_nethil, mei, vallinam, mellinam, ithaiyinam, uyirmei, uyirmai_kuril, uyirmai_nethil, kutriyalugaram, uyiralapedai, otralapedai, udambadumei, one_letter_words, suttu_vina, numerals, viyankol, granda

uyir = {u'அ':'a',u'ஆ':'A',u'இ':'i',u'ஈ':'I',u'உ':'u',u'ஊ':'U',u'எ':'e',u'ஏ':'E',u'ஐ':'Y',u'ஒ':'o',u'ஓ':'O',u'ஔ':'V'}
aytham = {'ஃ':'X'}
uyir_kuril = [u'அ',u'இ',u'உ',u'எ',u'ஒ']
uyil_nethil = [u'ஆ',u'ஈ',u'ஊ',u'ஏ',u'ஐ',u'ஓ',u'ஒள']

mei = {u'க்':'k',u'ச்':'c',u'ட்':'d',u'த்':'t',u'ப்':'p',u'ற்':'R',u'ஞ்':'q',u'ங்':'M',u'ண்':'N',u'ந்':'w',u'ம்':'m',u'ன்':'n',u'ய்':'y',u'ர்':'r',u'ல்':'l',u'வ்':'v',u'ழ்':'z',u'ள்':'L'}
vallinam =  [u'க்',u'ச்',u'ட்',u'த்',u'ப்',u'ற்']
mellinam = [u'ங்',u'ஞ்',u'ண்',u'ந்',u'ம்',u'ன்']
ithaiyinam = [u'ய்',u'ர்',u'ல்',u'வ்',u'ழ்',u'ள்']

uyirmei = {u'க':'ka',u'கா':'kA',u'கி':'ki',u'கீ':'kI',u'கு':'ku',u'கூ':'kU',u'கெ':'ke',u'கே':'kE',u'கை':'kY',u'கொ':'ko',u'கோ':'kO',u'கௌ':'kV',
           u'ங':'Ma',u'ஙா':'MA',u'ஙி':'Mi',u'ஙீ':'MI',u'ஙு':'Mu',u'ஙூ':'MU',u'ஙெ':'Me',u'ஙே':'ME',u'ஙை':'MY',u'ஙொ':'Mo',u'ஙோ':'MO',u'ஙௌ':'MV',
           u'ச':'ca',u'சா':'cA',u'சி':'ci',u'சீ':'cI',u'சு':'cu',u'சூ':'cU',u'செ':'ce',u'சே':'cE',u'சை':'cY',u'சொ':'co',u'சோ':'cO',u'சௌ':'cV',
           u'ஞ':'ba',u'ஞா':'bA',u'ஞி':'bi',u'ஞீ':'bI',u'ஞு':'bu',u'ஞூ':'bU',u'ஞெ':'be',u'ஞே':'bE',u'ஞை':'bY',u'ஞொ':'bo',u'ஞோ':'bO',u'ஞௌ':'bV',
           u'ட':'da',u'டா':'dA',u'டி':'di',u'டீ':'dI',u'டு':'du',u'டூ':'dU',u'டெ':'de',u'டே':'dE',u'டை':'dY',u'டொ':'do',u'டோ':'dO',u'டௌ':'dV',
           u'ண':'Na',u'ணா':'NA',u'ணி':'Ni',u'ணீ':'NI',u'ணு':'Nu',u'ணூ':'NU',u'ணெ':'Ne',u'ணே':'NE',u'ணை':'NY',u'ணொ':'No',u'ணோ':'NO',u'ணௌ':'NV',
           u'த':'ta',u'தா':'tA',u'தி':'ti',u'தீ':'tI',u'து':'tu',u'தூ':'tU',u'தெ':'te',u'தே':'tE',u'தை':'tY',u'தொ':'to',u'தோ':'tO',u'தௌ':'tV',
           u'ந':'wa',u'நா':'wA',u'நி':'wi',u'நீ':'wI',u'நு':'wu',u'நூ':'wU',u'நெ':'we',u'நே':'wE',u'நை':'wY',u'நொ':'wo',u'நோ':'wO',u'நௌ':'wV',
           u'ப':'pa',u'பா':'pA',u'பி':'pi',u'பீ':'pI',u'பு':'pu',u'பூ':'pU',u'பெ':'pe',u'பே':'pE',u'பை':'pY',u'பொ':'po',u'போ':'pO',u'பௌ':'pV',
           u'ம':'ma',u'மா':'mA',u'மி':'mi',u'மீ':'mI',u'மு':'mu',u'மூ':'mU',u'மெ':'me',u'மே':'mE',u'மை':'mY',u'மொ':'mo',u'மோ':'mO',u'மௌ':'mV',
           u'ய':'ya',u'யா':'yA',u'யி':'yi',u'யீ':'yI',u'யு':'yu',u'யூ':'yU',u'யெ':'ye',u'யே':'yE',u'யை':'yY',u'யொ':'yo',u'யோ':'yO',u'யௌ':'yV',
           u'ர':'ra',u'ரா':'rA',u'ரி':'ri',u'ரீ':'rI',u'ரு':'ru',u'ரூ':'rU',u'ரெ':'re',u'ரே':'rE',u'ரை':'rY',u'ரொ':'ro',u'ரோ':'rO',u'ரௌ':'rV',
           u'ல':'la',u'லா':'lA',u'லி':'li',u'லீ':'lI',u'லு':'lu',u'லூ':'lU',u'லெ':'le',u'லே':'lE',u'லை':'lY',u'லொ':'lo',u'லோ':'lO',u'லௌ':'lV',
           u'வ':'va',u'வா':'vA',u'வி':'vi',u'வீ':'vI',u'வு':'vu',u'வூ':'vU',u'வெ':'ve',u'வே':'vE',u'வை':'vY',u'வொ':'vo',u'வோ':'vO',u'வௌ':'vV',
           u'ழ':'za',u'ழா':'zA',u'ழி':'zi',u'ழீ':'zI',u'ழு':'zu',u'ழூ':'zU',u'ழெ':'ze',u'ழே':'zE',u'ழை':'zY',u'ழொ':'zo',u'ழோ':'zO',u'ழௌ':'zV',
           u'ள':'La',u'ளா':'LA',u'ளி':'Li',u'ளீ':'LI',u'ளு':'Lu',u'ளூ':'LU',u'ளெ':'Le',u'ளே':'LE',u'ளை':'LY',u'ளொ':'Lo',u'ளோ':'LO',u'ளௌ':'LV',
           u'ற':'Ra',u'றா':'RA',u'றி':'Ri',u'றீ':'RI',u'று':'Ru',u'றூ':'RU',u'றெ':'Re',u'றே':'RE',u'றை':'RY',u'றொ':'Ro',u'றோ':'RO',u'றௌ':'RV',
           u'ன':'na',u'னா':'nA',u'னி':'ni',u'னீ':'nI',u'னு':'nu',u'னூ':'nU',u'னெ':'ne',u'னே':'nE',u'னை':'nY',u'னொ':'no',u'னோ':'nO',u'னௌ':'nV'}
           
uyirmai_kuril = [u'க',u'கி',u'கு',u'கெ',u'கொ',
                  u'ங',u'ஙி',u'ஙு',u'ஙெ',u'ஙொ',
                  u'ச',u'சி',u'சு',u'செ',u'சொ',
                  u'ஞ',u'ஞி',u'ஞு',u'ஞெ',u'ஞொ',
                  u'ட',u'டி',u'டு',u'டெ',u'டொ',
                  u'ண',u'ணி',u'ணு',u'ணெ',u'ணொ',
                  u'த',u'தி',u'து',u'தெ',u'தொ',
                  u'ந',u'நி',u'நு',u'நெ',u'நொ',
                  u'ப',u'பி',u'பு',u'பெ',u'பொ',
                  u'ம',u'மி',u'மு',u'மெ',u'மொ',
                  u'ய',u'யி',u'யு',u'யெ',u'யொ',
                  u'ர',u'ரி',u'ரு',u'ரெ',u'ரொ',
                  u'ல',u'லி',u'லு',u'லெ',u'லொ',
                  u'வ',u'வி',u'வு',u'வெ',u'வொ',
                  u'ழ',u'ழி',u'ழு',u'ழெ',u'ழொ',
                  u'ள',u'ளி',u'ளு',u'ளெ',u'ளொ',
                  u'ற',u'றி',u'று',u'றெ',u'றொ',
                  u'ன',u'னி',u'னு',u'னெ',u'னொ']

uyirmai_nethil = [u'கா',u'கீ',u'கூ',u'கே',u'கை',u'கோ',u'கௌ',
                  u'ஙா',u'ஙீ',u'ஙூ',u'ஙே',u'ஙை',u'ஙோ',u'ஙௌ',
                  u'சா',u'சீ',u'சூ',u'சே',u'சை',u'சோ',u'சௌ',
                  u'ஞா',u'ஞீ',u'ஞூ',u'ஞே',u'ஞை',u'ஞோ',u'ஞௌ',
                  u'டா',u'டீ',u'டூ',u'டே',u'டை',u'டோ',u'டௌ',
                  u'ணா',u'ணீ',u'ணூ',u'ணே',u'ணை',u'ணோ',u'ணௌ',
                  u'தா',u'தீ',u'தூ',u'தே',u'தை',u'தோ',u'தௌ',
                  u'நா',u'நீ',u'நூ',u'நே',u'நை',u'நோ',u'நௌ',
                  u'பா',u'பீ',u'பூ',u'பே',u'பை',u'போ',u'பௌ',
                  u'மா',u'மீ',u'மூ',u'மே',u'மை',u'மோ',u'மௌ',
                  u'யா',u'யீ',u'யூ',u'யே',u'யை',u'யோ',u'யௌ',
                  u'ரா',u'ரீ',u'ரூ',u'ரே',u'ரை',u'ரோ',u'ரௌ',
                  u'லா',u'லீ',u'லூ',u'லே',u'லை',u'லோ',u'லௌ',
                  u'வா',u'வீ',u'வூ',u'வே',u'வை',u'வோ',u'வௌ',
                  u'ழா',u'ழீ',u'ழூ',u'ழே',u'ழை',u'ழோ',u'ழௌ',
                  u'ளா',u'ளீ',u'ளூ',u'ளே',u'ளை',u'ளோ',u'ளௌ',
                  u'றா',u'றீ',u'றூ',u'றே',u'றை',u'றோ',u'றௌ',
                  u'னா',u'னீ',u'னூ',u'னே',u'னை',u'னோ',u'னௌ']

kutriyalugaram = [u'கு',u'சு',u'டு',u'து',u'பு',u'று'] 
uyiralapedai = [u'ஆ',u'ஈ',u'ஊ',u'ஏ',u'ஐ',u'ஓ',u'ஒள']
otralapedai = [u'ங்',u'ஞ்',u'ண்',u'ந்',u'ம்',u'ய்',u'ல்',u'வ்',u'ள்',u'ன்',u'ஃ']
udambadumei = [u'ய',u'வ']
one_letter_words=[u'கை',u'தீ',u'தை',u'பூ',u'மை']
suttu_vina=[u'அ',u'ஆ',u'இ',u'ஈ',u'எ',u'யா']
numerals=[u'ஒன்று',u'இரண்டு',u'மூன்று',u'நான்கு',u'ஐந்து',u'ஆறு',u'நூறு',u'ஏழு',u'ஒன்பது',u'ஒரு',u'இரு',u'அறு',u'எழு']
viyankol=[u'கற்க',u'நில்',u'கவனி',u'செல்',u'செல்க',u'மன்னிய',u'வெல்க',u'செப்பும்',u'வினாவும்',u'வாழ்க',u'ஓம்பல்',u'அஞ்சாமை',u'வாழி',u'வீழ்க',u'ஒழிக',u'வருக',u'உண்க',u'அருள்க',u'கருணைபுரிக',u'வருக',u'வாழிய',
u'வாழியர்',u'வாரற்க',u'கூறற்க',u'செல்லற்க',u'வாரல்',u'செல்லல்',u'பகரேல்']
granda={
u'ஜ்':'j',u'ஷ்':'S',u'ஸ்':'s',u'ஹ்':'h'
,u'ஶ':'za',u'ஶா':'zA',u'ஶி':'zi',u'ஶீ':'zI',u'ஶு':'zu',u'ஶூ':'zU',u'ஶெ':'ze',u'ஶே':'zE',u'ஶை':'zY',u'ஶொ':'zo',u'ஶோ':'zO',u'ஶௌ':'zV'
,u'ஜ':'ja',u'ஜா':'jA',u'ஜி':'ji',u'ஜீ':'jI',u'ஜு':'ju',u'ஜூ':'jU',u'ஜெ':'je',u'ஜே':'jE',u'ஜை':'jY',u'ஜொ':'jo',u'ஜோ':'jO',u'ஜௌ':'jV'
,u'ஷ':'Sa',u'ஷா':'SA',u'ஷி':'Si',u'ஷீ':'SI',u'ஷு':'Su',u'ஷூ':'SU',u'ஷெ':'Se',u'ஷே':'SE',u'ஷை':'SY',u'ஷொ':'So',u'ஷோ':'SO',u'ஷௌ':'SV'
,u'ஸ':'sa',u'ஸா':'sA',u'ஸி':'si',u'ஸீ':'sI',u'ஸு':'su',u'ஸூ':'sU',u'ஸெ':'se',u'ஸே':'sE',u'ஸை':'sY',u'ஸொ':'so',u'ஸோ':'sO',u'ஸௌ':'sV'
,u'ஹ':'ha',u'ஹா':'hA',u'ஹி':'hi',u'ஹீ':'hI',u'ஹு':'hu',u'ஹூ':'hU',u'ஹெ':'he',u'ஹே':'hE',u'ஹை':'hY',u'ஹொ':'ho',u'ஹோ':'hO',u'ஹௌ':'hV'
,u'க்ஷ':'xa',u'க்ஷா':'xA',u'க்ஷி':'xi',u'க்ஷீ':'xI',u'க்ஷு':'xu',u'க்ஷூ':'xU',u'க்ஷெ':'xe',u'க்ஷே':'xE',u'க்ஷை':'xY',u'க்ஷொ':'xo',u'க்ஷோ':'xO',u'க்ஷௌ':'xV'
}

tamil_stopwords = [u'ஒரு',u'என்று',u'மற்றும்',u'இந்த',u'இது',u'என்ற',u'கொண்டு',u'என்பது',u'பல',u'ஆகும்',u'அல்லது',u'அவர்',u'நான்',u'உள்ள',u'அந்த',u'இவர்',u'என',u'முதல்',u'என்ன',u'இருந்து',u'சில',u'என்',u'போன்ற',u'வேண்டும்',u'வந்து',u'இதன்',u'அது',u'அவன்',u'தான்',u'பலரும்',u'என்னும்',u'மேலும்',u'பின்னர்',u'கொண்ட',u'இருக்கும்',u'தனது',u'உள்ளது',u'போது',u'என்றும்',u'அதன்',u'தன்',u'பிறகு',u'அவர்கள்',u'வரை',u'அவள்',u'நீ',u'ஆகிய',u'இருந்தது',u'உள்ளன',u'வந்த',u'இருந்த',u'மிகவும்',u'இங்கு',u'மீது',u'ஓர்',u'இவை',u'இந்தக்',u'பற்றி',u'வரும்',u'வேறு',u'இரு',u'இதில்',u'போல்',u'இப்போது',u'அவரது',u'மட்டும்',u'இந்தப்',u'எனும்',u'மேல்',u'பின்',u'சேர்ந்த',u'ஆகியோர்',u'எனக்கு',u'இன்னும்',u'அந்தப்',u'அன்று',u'ஒரே',u'மிக',u'அங்கு',u'பல்வேறு',u'விட்டு',u'பெரும்',u'அதை',u'பற்றிய',u'உன்',u'அதிக',u'அந்தக்',u'பேர்',u'இதனால்',u'அவை',u'அதே',u'ஏன்',u'முறை',u'யார்',u'என்பதை',u'எல்லாம்',u'மட்டுமே',u'இங்கே',u'அங்கே',u'இடம்',u'இடத்தில்',u'அதில்',u'நாம்',u'அதற்கு',u'எனவே',u'பிற',u'சிறு',u'மற்ற',u'விட',u'எந்த',u'எனவும்',u'எனப்படும்',u'எனினும்',u'அடுத்த',u'இதனை',u'இதை',u'கொள்ள',u'இந்தத்',u'இதற்கு',u'அதனால்',u'தவிர',u'போல',u'வரையில்',u'சற்று',u'எனக்']
